# GetConvertedFabricationPartsWithInvalidConnections Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DesignToFabricationConverter..::..GetConvertedFabricationPartsWithInvalidConnections Method
DesignToFabricationConverter Class See Also
---
Gets the collection of converted fabrication parts with invalid connections.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IDictionary<ElementId, ElementId> GetConvertedFabricationPartsWithInvalidConnections()
```

Visual Basic
---
```text
Public Function GetConvertedFabricationPartsWithInvalidConnections As IDictionary(Of ElementId, ElementId)
```

Visual C++
---
```text
public:
IDictionary<ElementId^, ElementId^>^ GetConvertedFabricationPartsWithInvalidConnections()
```

# Remarks
This set of element identifiers is only available after the **Convert** method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.
# See Also
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace